//* Розгалуження: if, if...else, else...if
//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// const str = 'bcde'
// if (str.startsWith('a')) {
//     console.log('Так');

// } else {
//     console.log('Ні');

// }

//TODO: 2 ===================================
// Написати скрипт, який перевіряє чи введене число через
// prompt потрапляє в діапазон від 55 до 99 включно.
// Якщо так, вивести в консоль "Число потрапляє в діапазон".
// Якщо ні, вивести в консоль "Число не потрапляє в діапазон".

// const number = prompt('Введіть число');

// if (number >= 55 && number <= 99  ) {
//     console.log('Число потрапляє в діапазон');

// } else {
//     console.log('Число не потрапляє в діапазон');

// }
// number >= 55 && number <= 99
//   ? console.log('Число потрапляє в діапазон')
//   : console.log('Число не потрапляє в діапазон');
